Revit 2027 API
DockablePane.SetTitle Method
 Set the title (a.k.a. window caption) of the dockable pane.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetTitle(
	string title
)
Public Sub SetTitle (
	title As String
)
public:
void SetTitle(
	String^ title
)
member SetTitle :
        title : string -> unit
Parameters
title String
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DockablePane Class
Autodesk.Revit.UI Namespace